---
kind: type
id: T:Autodesk.Revit.DB.ExportLineweightTableIterator
source: html/84d255f3-ffc6-5458-1655-f109db371045.htm
---
# Autodesk.Revit.DB.ExportLineweightTableIterator

An iterator to a set of line weight table.

## Syntax (C#)
```csharp
public class ExportLineweightTableIterator : IEnumerator<KeyValuePair<ExportLineweightKey, ExportLineweightInfo>>
```